// © Copyright 2004-2010, 2015 HP Development Company, L.P.

TaskName = "更新固件";

// Errors
FileOpenError = "无法打开文件 %@";
FileOpenErrorExplanation = "此文件已损坏，或者已被移至另一位置、重命名或者删除。请检查文件位置或者选择其他文件并重试。";
PrintChannelOpenError = "无法打开打印机通道";
PrintChannelOpenErrorExplanation = "请检查打印机是否已连接并开启，然后重试。";
SendDataError = "无法将数据发送到打印机";
SendDataErrorExplanation = "请检查打印机是否已连接并开启，然后重试。";

SomePenErrorTitle = "无法更新固件";
DoorOpenMsg = "因为某个盖子已打开，所以无法更新固件。请关闭打印机上所有的盖子。";

// Aquamarine Errors
FileCheckError = "无法更新固件";
FileCheckErrorExplanation = "固件软件包无效。请选择其他文件，然后重试。";

OkButton = "确定";
CancelButton = "取消";
FirmwareUpdateTitle = "固件更新";
FirmwareUpdateDeviceState = "正在打印";
FirmwareUpdateCancelingDeviceState = "正在取消";

// Great Wall Messages
PrinterIdleWarning = "如果打印机处于繁忙状态（例如，正在打印某项作业或正在校准），固件更新可能会失败。\n\n请在进行固件更新过程之前先检查您的打印机是否处于空闲状态。";
UpdateSuccessful = "固件文件已成功上载，您的打印机将被更新。\n\n固件更新完成后，您的打印机将自动重新启动。";
InvalidPackage = "固件文件存在问题，固件更新过程未能成功完成。问题可能由传输错误导致的。\n\n请重试固件更新过程。\n如果问题依然存在，请联系“HP 支持”。";
FailedDependencies = "固件更新过程由于相关性问题而无法成功完成。\n\n当前的固件版本是 %@，而您尝试安装的版本是 %@。\n\n请访问以下 Web 页，找到与该打印机相应的更新软件包：\n%@。";
NotNow = "由于打印机处于繁忙状态（例如，正在处理或打印作业），固件更新未能成功执行。\n\n请验证您的打印机处于空闲状态，然后再次执行固件更新。";
TransmissionError = "由于一些传输问题，导致未能成功执行固件更新。\n\n请检查打印机的连接，然后再次执行固件更新。";
LicenseNotAccepted = "许可证尚未被接受，因此固件更新还未执行。";
FatalError = "存在一些阻碍成功完成固件更新过程的问题。\n\n如果问题依然存在，请联系 HP 支持中心。";

// layout
TaskTitle = "更新固件";
TaskDescription = "选择包含固件更新的文件，然后将该文件传送至要更新该文件的打印机。";
FileNameTitle = "文件名：";
FileNameField = "<未选择>";
ChooseButton = "选择…";
UpdateButton = "更新";
ProgressPanel = "更新进度";
FirmwareUpdateProcessTitle = "正在更新…";
